katest.ЕТС_Кастомизация/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ceef4a2-6b58-45a0-8a75-bb6e3004590f">
  <name>ЗаказКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b6951ae3-bd6b-4547-a0ed-f8cb252badb3">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8d06692-73f7-469f-a6a7-388a13d421d2">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1a14d675-c2a2-4a16-978c-9044aa42660a">
    <name>СуммаПредоплатыДоОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="75bf369d-e0ba-4ded-a392-7292f757e439">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c728d38-3039-41f6-b288-2b92f32630c3">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1c757d5d-0c97-4216-8b3f-90737b1b485f">
    <name>ДатаПоДаннымКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0a1a3da1-943d-49ab-9c34-a8ed2e386612">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c683aebd-f890-44bb-bbe3-b67f7e95b55b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d68151c-a9dd-450f-8139-3be6ac926f58">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1974cb5e-5162-4f59-90ce-866449e6abe0">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d462888a-fa46-4e10-842a-8647c5c2ab42">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4ff8b2cf-1c36-4154-b5e4-fbc8a3ba5ea5">
    <name>СуммаАвансаДоОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9b03f67d-2b7d-4c73-a988-943a154dbef7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="09d5679e-99d4-4bae-a2be-ab43f7ffaaae">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1db6dac-b3bd-439d-b32b-faf174bb385a">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="435746b1-202f-40da-adae-b8569d4b81e8">
    <name>СуммаВозвратнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e925be7d-2573-499a-98d3-d4083edd7cb4">
    <name>ГрафикОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="21767e3f-5e9d-43d3-803c-eaf6279e10db">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="872dcece-786c-416e-bfa4-4ce98df56dd6">
    <name>НомерПоДаннымКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2261fcc3-938d-4df2-a64b-de5601c36355">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c52d49cc-c442-472e-9894-2b37fc9463d8">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

katest.ЕТС_Кастомизация/src/InformationRegisters/СостоянияПоОбъектамУчетаЭДО/СостоянияПоОбъектамУчетаЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="94cb8fd8-e78e-4367-870e-e56a7e5e245d">
  <name>СостоянияПоОбъектамУчетаЭДО</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <attributes extendedConfigurationObject="cb90bdf4-c492-45ef-b596-12109e8f7847">
    <name>ПредставлениеСостояния</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:InformationRegister>

katest.ЕТС_Кастомизация/src/Documents/ЗаказКлиента/Forms/ФормаСпискаДокументов/Module.bsl
&После("УстановитьУсловноеОформление")
&НаСервере
Процедура ЕТС_УстановитьУсловноеОформление()
	СписокУсловноеОформление = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	// Выделение цветом 
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	//Синий-всего хватает
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Использование = Истина;	
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Минимум");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Максимум" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовКлиентов.Закрыт;			
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(51, 102, 255));
		
	//Зелёный-чего то не хватает
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Использование = Истина;	
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Минимум");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Максимум" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовКлиентов.Закрыт;			
	
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(51, 153, 102));
	//Красный-всего не хватает
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Использование = Истина;	
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Минимум");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Максимум" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
		
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние" );
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовКлиентов.Закрыт;			
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(219, 88, 0));
	
КонецПроцедуры

&НаСервере
Процедура ЕТС_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Список.ТекстЗапроса =
			"	ВЫБРАТЬ
			|	ДокументЗаказКлиента.Ссылка КАК Ссылка,
			|	ДокументЗаказКлиента.ПометкаУдаления КАК ПометкаУдаления,
			|	ДокументЗаказКлиента.Номер КАК Номер,
			|	ДокументЗаказКлиента.Дата КАК Дата,
			|	ДокументЗаказКлиента.НомерПоДаннымКлиента КАК НомерПоДаннымКлиента,
			|	ДокументЗаказКлиента.ДатаПоДаннымКлиента КАК ДатаПоДаннымКлиента,
			|	ДокументЗаказКлиента.Проведен КАК Проведен,
			|	ДокументЗаказКлиента.Приоритет КАК Приоритет,
			|	ДокументЗаказКлиента.Партнер КАК Партнер,
			|	ДокументЗаказКлиента.Контрагент КАК Контрагент,
			|	ДокументЗаказКлиента.Организация КАК Организация,
			|	ДокументЗаказКлиента.Соглашение КАК Соглашение,
			|	ДокументЗаказКлиента.Договор КАК Договор,
			|	ДокументЗаказКлиента.Сделка КАК Сделка,
			|	ДокументЗаказКлиента.Валюта КАК Валюта,
			|	ДокументЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
			|	ДокументЗаказКлиента.СуммаВозвратнойТары КАК СуммаВозвратнойТары,
			|	ДокументЗаказКлиента.ГрафикОплаты КАК ГрафикОплаты,
			|	ДокументЗаказКлиента.Склад КАК Склад,
			|	ДокументЗаказКлиента.Статус КАК Статус,
			|	ДокументЗаказКлиента.Менеджер КАК Менеджер,
			|	ДокументЗаказКлиента.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
			|	ДокументЗаказКлиента.СуммаАвансаДоОбеспечения КАК СуммаАвансаДоОбеспечения,
			|	ДокументЗаказКлиента.СуммаПредоплатыДоОтгрузки КАК СуммаПредоплатыДоОтгрузки,
			|	ДокументЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
			|	ДокументЗаказКлиента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
			|	ДокументЗаказКлиента.ПорядокРасчетов КАК ПорядокРасчетов,
			|	ДокументЗаказКлиента.Комментарий КАК Комментарий,
			|	ВЫБОР
			|		КОГДА (НЕ ДокументЗаказКлиента.Проведен)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ПустаяСсылка)
			|		ИНАЧЕ ЕСТЬNULL(СостоянияЗаказовКлиентов.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт))
			|	КОНЕЦ КАК Состояние,
			|	ВЫБОР
			|		КОГДА (НЕ ДокументЗаказКлиента.Проведен)
			|			ТОГДА ЛОЖЬ
			|		КОГДА СостоянияЗаказовКлиентов.ДатаСобытия <> ДАТАВРЕМЯ(1, 1, 1)
			|		И &ДатаАктуальности > СостоянияЗаказовКлиентов.ДатаСобытия
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Просрочен,
			|	ВЫБОР
			|		КОГДА ДокументЗаказКлиента.Приоритет В
			|			(ВЫБРАТЬ ПЕРВЫЕ 1
			|				Приоритеты.Ссылка КАК Приоритет
			|			ИЗ
			|				Справочник.Приоритеты КАК Приоритеты
			|			УПОРЯДОЧИТЬ ПО
			|				Приоритеты.РеквизитДопУпорядочивания)
			|			ТОГДА 0
			|		КОГДА ДокументЗаказКлиента.Приоритет В
			|			(ВЫБРАТЬ ПЕРВЫЕ 1
			|				Приоритеты.Ссылка КАК Приоритет
			|			ИЗ
			|				Справочник.Приоритеты КАК Приоритеты
			|			УПОРЯДОЧИТЬ ПО
			|				Приоритеты.РеквизитДопУпорядочивания УБЫВ)
			|			ТОГДА 2
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК КартинкаПриоритета,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОплаты, 0) КАК СуммаОплаты,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОплаты, 0) КАК ПроцентОплаты,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОтгрузки, 0) КАК СуммаОтгрузки,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОтгрузки, 0) КАК ПроцентОтгрузки,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0) < 0
			|			ТОГДА -ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК НашДолг,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0) > 0
			|			ТОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ДолгКлиента,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентДолга, 0) КАК ПроцентДолга,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСобытия,
			|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ЕстьРасхожденияОрдерНакладная, ЛОЖЬ) КАК ЕстьРасхожденияОрдерНакладная,
			|	СостоянияЭД.СостояниеЭДО,
			|	СостоянияЭД.ПредставлениеСостояния,
			|	ДокументЗаказКлиента.Автор,
			|	ДокументЗаказКлиента.ЭтоЗаказКакСчет КАК ЭтоЗаказКакСчет,
			//Добавлено по отношению к типовой Начало
			|	ТЧ_Товары.Минимум КАК Минимум,
			|	ТЧ_Товары.Максимум КАК Максимум,
			//Добавлено по отношению к типовой Конец			
			|	&ДополнительныеПоляСостояниеEDI КАК ДополнительныеПоляСостояниеEDI
			|ИЗ
			|	Документ.ЗаказКлиента КАК ДокументЗаказКлиента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
			|		ПО (СостоянияЗаказовКлиентов.Заказ = ДокументЗаказКлиента.Ссылка)
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
			|		ПО (СостоянияЭД.СсылкаНаОбъект = ДокументЗаказКлиента.Ссылка)}
			//Добавлено по отношению к типовой Начало			
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЗаказКлиентаТовары.Ссылка КАК Ссылка,
			|			МИНИМУМ(ЗаказКлиентаТовары.КоличествоУпаковок <= ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток, 0)) КАК
			|				Минимум,
			|			МАКСИМУМ(ЗаказКлиентаТовары.КоличествоУпаковок <= ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток, 0)) КАК
			|				Максимум
			|		ИЗ
			|			Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки КАК ЗапасыИПотребностиОстатки
			|				ПО ЗаказКлиентаТовары.Номенклатура = ЗапасыИПотребностиОстатки.Номенклатура
			|				И ЗаказКлиентаТовары.Характеристика = ЗапасыИПотребностиОстатки.Характеристика
			|				И ЗаказКлиентаТовары.Склад = ЗапасыИПотребностиОстатки.Склад
			|				И ВЫБОР
			|					КОГДА ЗаказКлиентаТовары.Обособленно
			|						ТОГДА ЗаказКлиентаТовары.Ссылка.Назначение = ЗапасыИПотребностиОстатки.Назначение
			|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = ЗапасыИПотребностиОстатки.Назначение
			|				КОНЕЦ
			|		ГДЕ
			|			НЕ ЗаказКлиентаТовары.Отменено
			|		СГРУППИРОВАТЬ ПО
			|			ЗаказКлиентаТовары.Ссылка) КАК ТЧ_Товары
			|		ПО ДокументЗаказКлиента.Ссылка = ТЧ_Товары.Ссылка";
			//Добавлено по отношению к типовой Конец

КонецПроцедуры

&НаКлиенте
Процедура ЕТС_СписокПриАктивизацииСтрокиПосле(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьТаблицуДвжений(Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДвжений(Ссылка)
	//Заполним таблицу движений!!!!!
	ЭтаФорма.ТаблицаДвижений.Загрузить(ЕТС_ОбщиеКомандыСервер.ПолучитьТаблицуДвиженийДляСпискаЗаказовКлиента(Ссылка));
	
КонецПроцедуры
